h2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 22:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HWK 2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jeffery Zucker" />
<meta name="description" content="Homework 2"
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">HWK 2
<br />
<span class="subtitle">Due Tuesday September 22nd, 6p.m.</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#(1)">(1)</a></li>
<li><a href="#(2)">(2)</a></li>
<li><a href="#(3)">(3)</a></li>
<li><a href="#(4)">(4)</a></li>
<li><a href="#Hwk-3-preview">Hwk 3 preview</a>
<ul>
<li><a href="#Hwk-3-(1)">Hwk 3 (1)</a></li>
<li><a href="#Hwk-3-(2)">Hwk 3 (2)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-(1)" class="outline-2">
<h2 id="(1)">(1)</h2>
<div class="outline-text-2" id="text-(1)">
<p>
Prove Cor. 1.5(c), the “⇒” direction.
</p>

<p>
Parts (a) and (b), and the “⇐” direction of (c) were 
proved in class.
</p>

<p>
For <b>extra credit</b>, give a proof that is “algebraic”, 
i.e., does not mention individual elements of the sets \(A\) and \(B\).
</p>
</div>
</div>

<div id="outline-container-(2)" class="outline-2">
<h2 id="(2)">(2)</h2>
<div class="outline-text-2" id="text-(2)">
<p>
Prove that
</p>
<ol class="org-ol">
<li><a id="org1073a1e"></a>
a right inverse need not be a left inverse, and vice versa,</li>
<li><a id="org6b3bace"></a>
a left inverse need not be unique,</li>
<li><a id="org01db253"></a>
a right inverse need not be unique,</li>
<li>a two-sided inverse <b>is</b> unique.</li>
</ol>

<p>
See p.1-7, Note.
</p>

<p>
In <a href="#org1073a1e">1</a>, <a href="#org6b3bace">2</a>, <a href="#org01db253">3</a> give examples.
</p>
</div>
</div>

<div id="outline-container-(3)" class="outline-2">
<h2 id="(3)">(3)</h2>
<div class="outline-text-2" id="text-(3)">
<p>
Prove part (2) ⇒ (3) of Theorem 1.9.
</p>

<p>
The rest was done in class.
</p>
</div>
</div>

<div id="outline-container-(4)" class="outline-2">
<h2 id="(4)">(4)</h2>
<div class="outline-text-2" id="text-(4)">
<p>
Prove:  A subset of a countable set is countable (Note (e), p.1-10)
</p>
</div>
</div>

<div id="outline-container-Hwk-3-preview" class="outline-2">
<h2 id="Hwk-3-preview">Hwk 3 preview</h2>
<div class="outline-text-2" id="text-Hwk-3-preview">
<p>
Because the number of problems in this section of the Notes is 
much greater than those in the next section, I am postponing the 
two questions below (which really belong here) to NEXT WEEK'S HOMEWORK.
I am nevertheless putting them here now, so that you can start thinking 
about them sooner, if you wish.
</p>
</div>

<div id="outline-container-Hwk-3-(1)" class="outline-3">
<h3 id="Hwk-3-(1)">Hwk 3 (1)</h3>
<div class="outline-text-3" id="text-Hwk-3-(1)">
<p>
Prove
</p>
<ol class="org-ol">
<li>If \(A ≈ B\) and \(A\) is finite then so is \(B\).</li>
<li>If \(A ≈ B\) and \(A\) is countably infinite then so is \(B\).</li>
<li>If \(A ≈ B\) and \(A\) is uncountable then so is \(B\).</li>
</ol>

<p>
See Note (f), p.1-10.
</p>
</div>
</div>

<div id="outline-container-Hwk-3-(2)" class="outline-3">
<h3 id="Hwk-3-(2)">Hwk 3 (2)</h3>
<div class="outline-text-3" id="text-Hwk-3-(2)">
<p>
Prove Theorem 1.13 (c): \(\text{PRED}(ℕ)\) is uncountable.
Use a diagonalization method.
</p>

<p>
<i>Do not</i> use the fact that
\(\text{PRED}(ℕ)\) is equinumerous with \(𝒫(ℕ)\).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jeffery Zucker</p>
     <p class="author">Contact: <a href="mailto:armstmp@mcmaster.ca">armstmp@mcmaster.ca</a></p>
     <p class="date">Original date: </p>
     <p class="date">Last updated: 2020-09-16 Wed 22:47</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.90 (<a href="https://orgmode.org">Org</a> mode 9.3.8)</p>
     <p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
